In [2]:
import pandas as pd
import numpy as np

In [3]:
# dataframe == schema(db, table)

In [4]:
# dataframe을 만드는 방법
# 1. 외부파일을 읽어온다.(scv, xlsx) ==> data
# 2. 데이터구조를 가지고 dataframe을 만들어주면 된다.
#    dic, list

In [5]:
# 항목명1    항목명2    항목명3    
# ---------------------------------
# 100       200         300
# 100       200         300

#{"항목명1" : [100,100], "항목명2" : [200,200]}

In [10]:
df = pd.DataFrame({"name" : ['홍길동', '박길동'],
             "age" : [100,30],
             "ex" : [1,2]})

In [11]:
df['name']

0    홍길동
1    박길동
Name: name, dtype: object

In [12]:
df['ex']

0    1
1    2
Name: ex, dtype: int64

In [14]:
df.describe() # 수치항목에 대해서만! 요약
# 개수, 평균(mean), 표준편차(std), min(최소값), max(최대값)
# 25%, 50%, 70%, 100%(4분위수)

              age        ex
count    2.000000  2.000000
mean    65.000000  1.500000
std     49.497475  0.707107
min     30.000000  1.000000
25%     47.500000  1.250000
50%     65.000000  1.500000
75%     82.500000  1.750000
max    100.000000  2.000000

In [29]:
import random
name_list = []
age_list = []
ex_list = []
for i in range(1000):
    name_list.append('이름' + str(i))
    age_list.append(random.randint(1, 120))
    ex_list.append(random.randint(1,2))
len(name_list), len(age_list), len(ex_list)

(1000, 1000, 1000)

In [30]:
name_list[:5], age_list[:5], ex_list[:5]

(['이름0', '이름1', '이름2', '이름3', '이름4'], [37, 16, 13, 116, 84], [1, 2, 2, 2, 1])

In [31]:
df2 = pd.DataFrame({"name" : name_list,
             "age" : age_list,
             "ex" : ex_list})
#1. df로 만들어보고,
#2. 데이터타입을 확인해보고, 
#3. 각 컬럼을 추춘해보고, 
#4. 숫자형 컬럼의 요약을 해보세요.

In [41]:
df2.dtypes

name    object
age      int64
ex       int64
dtype: object

In [42]:
df2.columns

Index(['name', 'age', 'ex'], dtype='object')

In [47]:
df2['age'], df2['ex'] #데이터프레임[컬럼]

(0       37
 1       16
 2       13
 3      116
 4       84
       ...
 995     70
 996    107
 997     76
 998      7
 999     63
 Name: age, Length: 1000, dtype: int64, 0      1
 1      2
 2      2
 3      2
 4      1
       ..
 995    1
 996    1
 997    2
 998    2
 999    2
 Name: ex, Length: 1000, dtype: int64)

In [48]:
df2.age, df2.ex

(0       37
 1       16
 2       13
 3      116
 4       84
       ...
 995     70
 996    107
 997     76
 998      7
 999     63
 Name: age, Length: 1000, dtype: int64, 0      1
 1      2
 2      2
 3      2
 4      1
       ..
 995    1
 996    1
 997    2
 998    2
 999    2
 Name: ex, Length: 1000, dtype: int64)

In [52]:
df2['age'] > 50 #브로드캐스팅

0      False
1      False
2      False
3       True
4       True
       ...
995     True
996     True
997     True
998    False
999     True
Name: age, Length: 1000, dtype: bool

In [53]:
df2['age'] - 10 #브로드캐스팅
#원본을 가져다가 처리하므로, df2는 바뀌지 않음
#(비파괴 연산)

0       27
1        6
2        3
3      106
4       74
      ...
995     60
996     97
997     66
998     -3
999     53
Name: age, Length: 1000, dtype: int64

In [55]:
df2['age2'] = df2['age'] - 10

In [57]:
df2

      name  age  ex  age2
0      이름0   37   1    27
1      이름1   16   2     6
2      이름2   13   2     3
3      이름3  116   2   106
4      이름4   84   1    74
..     ...  ...  ..   ...
995  이름995   70   1    60
996  이름996  107   1    97
997  이름997   76   2    66
998  이름998    7   2    -3
999  이름999   63   2    53

[1000 rows x 4 columns]

df2['name'] = df2['name'] + '님'
df2['name']